--------------------------------------------------------------------------------
      name:  osf20
       log:  /Users/mmking/Documents/SocResearch/SocArXiv_gender/stata/osf20_aut
> hor_outcomes.smcl
  log type:  text
 opened on:   3 Mar 2025, 13:51:35

. 
. //      project:        SocArXiv
. 
. //  task:               Feminist Careers: Author Outcomes
. //                              Merge all WoS + OSF + Survey
. 
. //  github:     SocArXiv_gender
. //  author:     Molly King 
. 
. display "$S_DATE  $S_TIME"
 3 Mar 2025  13:51:35

. 
. ***--------------------------***
. // PROGRAM SETUP
. ***--------------------------***
. 
. version 18 // keeps program consistent for future replications

. set linesize 80

. clear all

. set more off

. 
. ***--------------------------***
. 
. use $raw/authors_table.dta, clear

. drop if responseid == ""
(14,350 observations deleted)

. 
. merge 1:1 responseid using $clean/survey_clean.dta

    Result                      Number of obs
    -----------------------------------------
    Not matched                           301
        from master                         0  (_merge==1)
        from using                        301  (_merge==2)

    Matched                            19,607  (_merge==3)
    -----------------------------------------

. drop if _merge == 2
(301 observations deleted)

. drop _merge

. 
. merge 1:m jm_auth_id using $raw/papers_authors_crosswalk.dta

    Result                      Number of obs
    -----------------------------------------
    Not matched                        23,589
        from master                         0  (_merge==1)
        from using                     23,589  (_merge==2)

    Matched                           469,259  (_merge==3)
    -----------------------------------------

. *drop if _merge == 2 // authors not in survey
. drop _merge

. 
. merge m:1 jm_paper_id using $raw/papers_table_with_metadata.dta

    Result                      Number of obs
    -----------------------------------------
    Not matched                           105
        from master                         0  (_merge==1)
        from using                        105  (_merge==2)

    Matched                           492,848  (_merge==3)
    -----------------------------------------

. drop if _merge == 2 // authors not in survey
(105 observations deleted)

. drop _merge

. 
. drop if responseid == ""  // authors not in survey
(23,589 observations deleted)

. 
. ***--------------------------***
. // VARIABLE CREATION
. ***--------------------------***
. 
. // Author ever posted to SocArXiv
. gen osfpub = .
(469,259 missing values generated)

.         replace osfpub = 0 if osfid == ""
(466,774 real changes made)

.         replace osfpub = 1 if osfid != ""
(2,485 real changes made)

. lab var osfpub "Paper submitted to SocArXiv"

. tab osfpub, m

      Paper |
  submitted |
to SocArXiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    466,774       99.47       99.47
          1 |      2,485        0.53      100.00
------------+-----------------------------------
      Total |    469,259      100.00

. 
. bysort responseid: egen osfpub_ever = max(osfpub)

.         tab osfpub_ever, m

osfpub_ever |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    438,679       93.48       93.48
          1 |     30,580        6.52      100.00
------------+-----------------------------------
      Total |    469,259      100.00

.         lab var osfpub_ever "Author ever posted to SocArXiv"

.         lab define osfpub_ever ///
>                 0 "never osfpub (author level)" ///
>                 1 "osfpub ever (author level)"

.         lab val osfpub_ever osfpub_ever

.         
. // Number of osfpubs per author
. bysort responseid: egen osfpub_num = total(osfpub)

. tab osfpub_num

 osfpub_num |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    438,679       93.48       93.48
          1 |     15,386        3.28       96.76
          2 |      5,220        1.11       97.87
          3 |      1,751        0.37       98.25
          4 |      2,593        0.55       98.80
          5 |      1,462        0.31       99.11
          6 |        646        0.14       99.25
          7 |        833        0.18       99.43
          8 |        589        0.13       99.55
          9 |        229        0.05       99.60
         10 |         71        0.02       99.62
         11 |        295        0.06       99.68
         12 |        383        0.08       99.76
         13 |         36        0.01       99.77
         14 |         19        0.00       99.77
         15 |        146        0.03       99.80
         16 |        298        0.06       99.87
         18 |         54        0.01       99.88
         19 |        174        0.04       99.92
         21 |        142        0.03       99.95
         22 |         34        0.01       99.95
         23 |         92        0.02       99.97
         25 |         41        0.01       99.98
         47 |         86        0.02      100.00
------------+-----------------------------------
      Total |    469,259      100.00

. lab var osfpub_num "No.SocArXiv pubs (by author)"

. 
. // Number of WoS records per author
. gen wospub = .
(469,259 missing values generated)

.         replace wospub = 0 if uid == ""
(1,171 real changes made)

.         replace wospub = 1 if uid != ""
(468,088 real changes made)

.         tab wospub, m

     wospub |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,171        0.25        0.25
          1 |    468,088       99.75      100.00
------------+-----------------------------------
      Total |    469,259      100.00

. by responseid: egen wospub_num = total(wospub)

. tab wospub_num, m

 wospub_num |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8        0.00        0.00
          1 |        537        0.11        0.12
          2 |      1,443        0.31        0.42
          3 |      2,475        0.53        0.95
          4 |      3,363        0.72        1.67
          5 |      4,366        0.93        2.60
          6 |      4,799        1.02        3.62
          7 |      5,607        1.19        4.82
          8 |      5,736        1.22        6.04
          9 |      5,617        1.20        7.24
         10 |      6,349        1.35        8.59
         11 |      6,593        1.40        9.99
         12 |      6,710        1.43       11.42
         13 |      7,052        1.50       12.93
         14 |      7,361        1.57       14.49
         15 |      7,613        1.62       16.12
         16 |      7,880        1.68       17.80
         17 |      7,712        1.64       19.44
         18 |      6,941        1.48       20.92
         19 |      7,849        1.67       22.59
         20 |      7,245        1.54       24.14
         21 |      8,273        1.76       25.90
         22 |      7,599        1.62       27.52
         23 |      7,026        1.50       29.01
         24 |      7,075        1.51       30.52
         25 |      6,903        1.47       31.99
         26 |      6,856        1.46       33.45
         27 |      6,542        1.39       34.85
         28 |      6,169        1.31       36.16
         29 |      7,074        1.51       37.67
         30 |      6,168        1.31       38.99
         31 |      6,774        1.44       40.43
         32 |      6,865        1.46       41.89
         33 |      5,425        1.16       43.05
         34 |      5,388        1.15       44.20
         35 |      5,611        1.20       45.39
         36 |      5,909        1.26       46.65
         37 |      5,818        1.24       47.89
         38 |      5,260        1.12       49.01
         39 |      4,877        1.04       50.05
         40 |      5,055        1.08       51.13
         41 |      4,849        1.03       52.16
         42 |      3,958        0.84       53.00
         43 |      4,018        0.86       53.86
         44 |      4,547        0.97       54.83
         45 |      4,348        0.93       55.76
         46 |      4,103        0.87       56.63
         47 |      4,466        0.95       57.58
         48 |      4,675        1.00       58.58
         49 |      4,822        1.03       59.61
         50 |      3,703        0.79       60.40
         51 |      3,265        0.70       61.09
         52 |      3,901        0.83       61.92
         53 |      3,182        0.68       62.60
         54 |      3,731        0.80       63.40
         55 |      3,416        0.73       64.12
         56 |      2,857        0.61       64.73
         57 |      3,282        0.70       65.43
         58 |      3,601        0.77       66.20
         59 |      2,540        0.54       66.74
         60 |      2,883        0.61       67.36
         61 |      2,871        0.61       67.97
         62 |      3,044        0.65       68.62
         63 |      2,898        0.62       69.23
         64 |      3,074        0.66       69.89
         65 |      3,058        0.65       70.54
         66 |      2,046        0.44       70.98
         67 |      2,480        0.53       71.50
         68 |      2,518        0.54       72.04
         69 |      2,278        0.49       72.53
         70 |      2,522        0.54       73.06
         71 |      2,277        0.49       73.55
         72 |      2,016        0.43       73.98
         73 |      2,630        0.56       74.54
         74 |      2,813        0.60       75.14
         75 |      1,970        0.42       75.56
         76 |      2,434        0.52       76.08
         77 |      2,620        0.56       76.64
         78 |      1,950        0.42       77.05
         79 |      2,133        0.45       77.51
         80 |      2,401        0.51       78.02
         81 |      1,215        0.26       78.28
         82 |      1,886        0.40       78.68
         83 |      1,746        0.37       79.05
         84 |      1,093        0.23       79.28
         85 |      1,531        0.33       79.61
         86 |        946        0.20       79.81
         87 |      2,002        0.43       80.24
         88 |      1,937        0.41       80.65
         89 |      1,068        0.23       80.88
         90 |      1,081        0.23       81.11
         91 |      1,365        0.29       81.40
         92 |      1,380        0.29       81.69
         93 |        837        0.18       81.87
         94 |      1,222        0.26       82.13
         95 |      1,140        0.24       82.37
         96 |        864        0.18       82.56
         97 |      1,164        0.25       82.81
         98 |        784        0.17       82.97
         99 |      1,386        0.30       83.27
        100 |        401        0.09       83.36
        101 |      1,010        0.22       83.57
        102 |      1,326        0.28       83.85
        103 |        727        0.15       84.01
        104 |      1,144        0.24       84.25
        105 |      1,273        0.27       84.52
        106 |      1,060        0.23       84.75
        107 |        856        0.18       84.93
        108 |        972        0.21       85.14
        109 |      1,308        0.28       85.42
        110 |        990        0.21       85.63
        111 |        889        0.19       85.82
        112 |      1,232        0.26       86.08
        113 |        796        0.17       86.25
        114 |        798        0.17       86.42
        115 |        924        0.20       86.62
        116 |        696        0.15       86.76
        117 |      2,457        0.52       87.29
        118 |        826        0.18       87.46
        119 |        597        0.13       87.59
        120 |        840        0.18       87.77
        121 |        605        0.13       87.90
        122 |        732        0.16       88.06
        123 |        984        0.21       88.27
        124 |        373        0.08       88.34
        125 |        750        0.16       88.50
        126 |        630        0.13       88.64
        127 |        635        0.14       88.77
        128 |        768        0.16       88.94
        129 |        516        0.11       89.05
        130 |        520        0.11       89.16
        131 |      1,310        0.28       89.44
        132 |        396        0.08       89.52
        133 |        802        0.17       89.69
        134 |        268        0.06       89.75
        135 |        675        0.14       89.89
        136 |        272        0.06       89.95
        137 |        548        0.12       90.07
        138 |        414        0.09       90.16
        139 |      1,112        0.24       90.39
        140 |        700        0.15       90.54
        141 |        423        0.09       90.63
        142 |        710        0.15       90.78
        143 |        286        0.06       90.85
        144 |        720        0.15       91.00
        145 |        290        0.06       91.06
        146 |        442        0.09       91.15
        147 |        147        0.03       91.19
        148 |        740        0.16       91.34
        149 |        149        0.03       91.38
        150 |        300        0.06       91.44
        151 |        302        0.06       91.50
        152 |        152        0.03       91.54
        153 |        153        0.03       91.57
        154 |        309        0.07       91.63
        155 |        465        0.10       91.73
        156 |        312        0.07       91.80
        157 |        314        0.07       91.87
        158 |        475        0.10       91.97
        159 |        318        0.07       92.04
        160 |        800        0.17       92.21
        161 |        805        0.17       92.38
        162 |        486        0.10       92.48
        163 |        815        0.17       92.66
        164 |        492        0.10       92.76
        167 |        167        0.04       92.80
        168 |        672        0.14       92.94
        169 |        338        0.07       93.01
        170 |        170        0.04       93.05
        172 |        344        0.07       93.12
        173 |        346        0.07       93.19
        174 |        522        0.11       93.31
        175 |        700        0.15       93.46
        176 |        176        0.04       93.49
        177 |        354        0.08       93.57
        179 |        179        0.04       93.61
        180 |        180        0.04       93.64
        183 |        183        0.04       93.68
        184 |        368        0.08       93.76
        186 |        558        0.12       93.88
        187 |        187        0.04       93.92
        189 |        189        0.04       93.96
        190 |        192        0.04       94.00
        192 |        384        0.08       94.08
        197 |        394        0.08       94.17
        198 |        198        0.04       94.21
        199 |        199        0.04       94.25
        200 |        400        0.09       94.34
        201 |        603        0.13       94.47
        202 |        202        0.04       94.51
        203 |        203        0.04       94.55
        204 |        408        0.09       94.64
        205 |        615        0.13       94.77
        206 |        618        0.13       94.90
        208 |        416        0.09       94.99
        209 |        418        0.09       95.08
        210 |        420        0.09       95.17
        211 |        211        0.04       95.21
        212 |        212        0.05       95.26
        214 |        428        0.09       95.35
        216 |        216        0.05       95.40
        217 |        217        0.05       95.44
        221 |        442        0.09       95.54
        222 |        444        0.09       95.63
        223 |        223        0.05       95.68
        224 |        224        0.05       95.73
        225 |        225        0.05       95.77
        226 |        452        0.10       95.87
        228 |        228        0.05       95.92
        230 |        230        0.05       95.97
        231 |        462        0.10       96.07
        232 |        469        0.10       96.17
        233 |        233        0.05       96.22
        234 |        234        0.05       96.27
        235 |        235        0.05       96.32
        236 |        236        0.05       96.37
        238 |        238        0.05       96.42
        241 |        241        0.05       96.47
        244 |        488        0.10       96.57
        246 |        246        0.05       96.63
        248 |        496        0.11       96.73
        251 |        251        0.05       96.78
        252 |        252        0.05       96.84
        255 |        510        0.11       96.95
        257 |        257        0.05       97.00
        262 |        524        0.11       97.11
        264 |        264        0.06       97.17
        268 |        268        0.06       97.23
        269 |        269        0.06       97.28
        270 |        270        0.06       97.34
        271 |        542        0.12       97.46
        272 |        272        0.06       97.52
        274 |        548        0.12       97.63
        275 |        275        0.06       97.69
        277 |        554        0.12       97.81
        281 |        844        0.18       97.99
        286 |        286        0.06       98.05
        291 |        291        0.06       98.11
        295 |        295        0.06       98.17
        316 |        316        0.07       98.24
        318 |        318        0.07       98.31
        320 |        320        0.07       98.38
        327 |        327        0.07       98.45
        333 |        333        0.07       98.52
        335 |        335        0.07       98.59
        349 |        349        0.07       98.66
        363 |        363        0.08       98.74
        364 |        364        0.08       98.82
        388 |        388        0.08       98.90
        401 |        401        0.09       98.99
        426 |        426        0.09       99.08
        431 |        431        0.09       99.17
        467 |        467        0.10       99.27
        503 |        503        0.11       99.38
        519 |        519        0.11       99.49
        523 |        523        0.11       99.60
        784 |        784        0.17       99.77
       1099 |      1,100        0.23      100.00
------------+-----------------------------------
      Total |    469,259      100.00

. lab var wospub_num "No. WoS pubs (by author)"

. 
. // % of work they osfpub
. gen wospub_osfposted = .
(469,259 missing values generated)

.         replace wospub_osfposted = 0 if osfpub == 0 & wospub == 1
(466,774 real changes made)

.         replace wospub_osfposted = 1 if osfpub == 1 & wospub == 1
(1,314 real changes made)

. tab wospub_osfposted, m

wospub_osfp |
      osted |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    466,774       99.47       99.47
          1 |      1,314        0.28       99.75
          . |      1,171        0.25      100.00
------------+-----------------------------------
      Total |    469,259      100.00

. 
. by responseid: egen wospub_osfposted_num = total(wospub_osfposted)

. lab var wospub_osfposted_num "No. WoS pubs posted on SocArXiv (by author)" 

.         
. gen osfpub_percent = wospub_osfposted_num / wospub_num
(8 missing values generated)

. lab var osfpub_percent "% WoS pubs posted on SocArXiv (by author)"

. sum osfpub_percent

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
osfpub_per~t |    469,251    .0030791    .0261805          0          1

. sort osfpub_percent

. 
. 
. // AUTHOR EVER PUBLISHED IN FEMINIST JOURNAL
. tab feminist_journal, m

feminist_jo |
      urnal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    465,500       99.20       99.20
          1 |      2,588        0.55       99.75
          . |      1,171        0.25      100.00
------------+-----------------------------------
      Total |    469,259      100.00

. lab var feminist_journal "Paper submitted to feminist journal"

. tab feminist_journal osfpub, m

     Paper |
 submitted |
        to |  Paper submitted to
  feminist |       SocArXiv
   journal |         0          1 |     Total
-----------+----------------------+----------
         0 |   464,215      1,285 |   465,500 
         1 |     2,559         29 |     2,588 
         . |         0      1,171 |     1,171 
-----------+----------------------+----------
     Total |   466,774      2,485 |   469,259 

. 
. bysort jm_auth_id: egen journal_feminist_ever = max(feminist_journal)
(8 missing values generated)

.         tab journal_feminist_ever, m

journal_fem |
 inist_ever |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    431,838       92.03       92.03
          1 |     37,413        7.97      100.00
          . |          8        0.00      100.00
------------+-----------------------------------
      Total |    469,259      100.00

.         lab var journal_feminist_ever "Author ever published article in femini
> st journal"

.         lab define journal_feminist_ever ///
>                 0 "never pub in feminist journal (author level)" ///
>                 1 "ever pub in feminist journal (author level)"

.         lab val journal_feminist_ever journal_feminist_ever

. tab journal_feminist_ever, m

       Author ever published article in |
                       feminist journal |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
never pub in feminist journal (author l |    431,838       92.03       92.03
ever pub in feminist journal (author le |     37,413        7.97      100.00
                                      . |          8        0.00      100.00
----------------------------------------+-----------------------------------
                                  Total |    469,259      100.00

. 
. ***--------------------------***
. // DESCRIPTIVE STATS
. ***--------------------------***
. 
. * count of SocArXiv papers
. tab osfpub

      Paper |
  submitted |
to SocArXiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    466,774       99.47       99.47
          1 |      2,485        0.53      100.00
------------+-----------------------------------
      Total |    469,259      100.00

. 
. * count of WoS papers
. tab wospub

     wospub |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,171        0.25        0.25
          1 |    468,088       99.75      100.00
------------+-----------------------------------
      Total |    469,259      100.00

. 
. ** % of total papers in WoS that come from (row name)
. tab wospub author_gender_woman, m

           |     Author woman
    wospub | Not woman      Woman |     Total
-----------+----------------------+----------
         0 |       835        336 |     1,171 
         1 |   316,592    151,496 |   468,088 
-----------+----------------------+----------
     Total |   317,427    151,832 |   469,259 

. di 151496/468088
.32364854

. 
. tab wospub author_gender_man, m

           |  Author gender man=1
           |         not=0
    wospub |   Not man        Man |     Total
-----------+----------------------+----------
         0 |       369        802 |     1,171 
         1 |   172,710    295,378 |   468,088 
-----------+----------------------+----------
     Total |   173,079    296,180 |   469,259 

. di 295378/468088
.63103092

. 
. tab wospub author_gender_tnb, m

           |      Author trans/nonbinary
    wospub |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |     1,135         10         26 |     1,171 
         1 |   445,647      3,626     18,815 |   468,088 
-----------+---------------------------------+----------
     Total |   446,782      3,636     18,841 |   469,259 

. di 3626/468088
.00774641

. 
. ** % of total submissions to SocArXiv that come from (row name)
. tab osfpub author_gender_woman, m

     Paper |
 submitted |
        to |     Author woman
  SocArXiv | Not woman      Woman |     Total
-----------+----------------------+----------
         0 |   315,634    151,140 |   466,774 
         1 |     1,793        692 |     2,485 
-----------+----------------------+----------
     Total |   317,427    151,832 |   469,259 

. di 692/2485
.27847082

. 
. tab osfpub author_gender_man, m

     Paper |
 submitted |  Author gender man=1
        to |         not=0
  SocArXiv |   Not man        Man |     Total
-----------+----------------------+----------
         0 |   172,307    294,467 |   466,774 
         1 |       772      1,713 |     2,485 
-----------+----------------------+----------
     Total |   173,079    296,180 |   469,259 

. di 1713/2485
.68933602

. 
. tab osfpub author_gender_tnb, m

     Paper |
 submitted |
        to |      Author trans/nonbinary
  SocArXiv |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |   444,381      3,614     18,779 |   466,774 
         1 |     2,401         22         62 |     2,485 
-----------+---------------------------------+----------
     Total |   446,782      3,636     18,841 |   469,259 

. di 22/2485
.00885312

. 
. 
. 
. ***--------------------------***
. // REDUCE down to AUTHOR-LEVEL
. ***--------------------------***
. 
. drop jm_paper_id uid osfid is_review is_oa pubyear wos_pubdate_clean pubtype d
> octypes n_references oa_types oa source_title date_created date_modified date_
> published original_publication_date likely* abstract* title_says_fem fulltext_
> ever_says_fem fem_added fem_removed feminist_journal cites* rank gender_and_so
> ciety sjr* hindex wospub osfpub wospub_osfposted soc_journal

. 
. duplicates drop

Duplicates in terms of all variables

(449,652 observations deleted)

. count
  19,607

. isid responseid

. 
. save $clean/survey_authors.dta, replace
file
    ~/Documents/SocResearch/SocArXiv_gender/data/clean_data/survey_authors.dta
    saved

. 
. ***--------------------------***
. // DEMOGRAPHICS of AUTHORS of PAPERS published on OSF vs and WHO DOESN'T (auth
> or level)
. ***--------------------------***
. 
. // OUR SURVEY
. tab author_gender_man, m

     Author |
     gender |
man=1 not=0 |      Freq.     Percent        Cum.
------------+-----------------------------------
    Not man |      8,612       43.92       43.92
        Man |     10,995       56.08      100.00
------------+-----------------------------------
      Total |     19,607      100.00

. tab author_gender_woman, m

     Author |
      woman |      Freq.     Percent        Cum.
------------+-----------------------------------
  Not woman |     11,903       60.71       60.71
      Woman |      7,704       39.29      100.00
------------+-----------------------------------
      Total |     19,607      100.00

. tab author_gender_tnb, m

     Author |
trans/nonbi |
       nary |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,651       95.12       95.12
          1 |        210        1.07       96.20
          . |        746        3.80      100.00
------------+-----------------------------------
      Total |     19,607      100.00

. 
. di 18909/19607
.96440047

. 
. // EVER SUBMIT
.         
. ** Among those who ever osfpub, what is gender breakdown
. table author_gender_man, stat(mean osfpub_ever) stat(n osfpub_ever) 

-------------------------------------------------------------------
                          |      Mean   Number of nonmissing values
--------------------------+----------------------------------------
Author gender man=1 not=0 |                                        
  Not man                 |  .0418021                         8,612
  Man                     |  .0507503                        10,995
  Total                   |    .04682                        19,607
-------------------------------------------------------------------

. tab author_gender_man osfpub_ever, m

    Author |
    gender | Author ever posted to
     man=1 |       SocArXiv
     not=0 | never osf  osfpub ev |     Total
-----------+----------------------+----------
   Not man |     8,252        360 |     8,612 
       Man |    10,437        558 |    10,995 
-----------+----------------------+----------
     Total |    18,689        918 |    19,607 

. di 558/918
.60784314

. 
. table author_gender_woman, stat(mean osfpub_ever) stat(n osfpub_ever) 

------------------------------------------------------
             |      Mean   Number of nonmissing values
-------------+----------------------------------------
Author woman |                                        
  Not woman  |  .0502394                        11,903
  Woman      |  .0415369                         7,704
  Total      |    .04682                        19,607
------------------------------------------------------

. tab author_gender_woman osfpub_ever, m

           | Author ever posted to
    Author |       SocArXiv
     woman | never osf  osfpub ev |     Total
-----------+----------------------+----------
 Not woman |    11,305        598 |    11,903 
     Woman |     7,384        320 |     7,704 
-----------+----------------------+----------
     Total |    18,689        918 |    19,607 

. di 320/918
.34858388

. 
. table author_gender_tnb, stat(mean osfpub_ever) stat(n osfpub_ever) 

----------------------------------------------------------------
                       |      Mean   Number of nonmissing values
-----------------------+----------------------------------------
Author trans/nonbinary |                                        
  0                    |  .0469144                        18,651
  1                    |  .0761905                           210
  Total                |  .0472403                        18,861
----------------------------------------------------------------

. tab author_gender_tnb osfpub_ever, m

    Author | Author ever posted to
trans/nonb |       SocArXiv
     inary | never osf  osfpub ev |     Total
-----------+----------------------+----------
         0 |    17,776        875 |    18,651 
         1 |       194         16 |       210 
         . |       719         27 |       746 
-----------+----------------------+----------
     Total |    18,689        918 |    19,607 

. di 16/918
.01742919

. 
. * total 
. di 918/19607
.04682001

.         
. // MEAN PUB COUNTS
. 
. ** Mean (SD) SocArXiv papers by (row name) -- for all authors
. table author_gender_man, stat(mean osfpub_num) stat(sd osfpub_num) stat (n osf
> pub_num)

----------------------------------------------------------------------------------------
                          |      Mean   Standard deviation   Number of nonmissing values
--------------------------+-------------------------------------------------------------
Author gender man=1 not=0 |                                                             
  Not man                 |  .0896424             .6514855                         8,612
  Man                     |  .1557981             1.128223                        10,995
  Total                   |  .1267404             .9493457                        19,607
----------------------------------------------------------------------------------------

. table author_gender_woman, stat(mean osfpub_num) stat(sd osfpub_num) stat (n o
> sfpub_num)

---------------------------------------------------------------------------
             |      Mean   Standard deviation   Number of nonmissing values
-------------+-------------------------------------------------------------
Author woman |                                                             
  Not woman  |  .1506343             1.096921                        11,903
  Woman      |  .0898235             .6576764                         7,704
  Total      |  .1267404             .9493457                        19,607
---------------------------------------------------------------------------

. table author_gender_tnb, stat(mean osfpub_num) stat(sd osfpub_num) stat (n osf
> pub_num)

-------------------------------------------------------------------------------------
                       |      Mean   Standard deviation   Number of nonmissing values
-----------------------+-------------------------------------------------------------
Author trans/nonbinary |                                                             
  0                    |   .128733             .9642375                        18,651
  1                    |  .1047619             .4572397                           210
  Total                |  .1284661             .9600649                        18,861
-------------------------------------------------------------------------------------

. 
. reg osfpub_num author_gender_woman

      Source |       SS           df       MS      Number of obs   =    19,607
-------------+----------------------------------   F(1, 19605)     =     19.21
       Model |  17.2951112         1  17.2951112   Prob > F        =    0.0000
    Residual |  17652.7549    19,605  .900421059   R-squared       =    0.0010
-------------+----------------------------------   Adj R-squared   =    0.0009
       Total |    17670.05    19,606  .901257267   Root MSE        =    .94891

-------------------------------------------------------------------------------
   osfpub_num | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |  -.0608108   .0138753    -4.38   0.000    -.0880076   -.0336141
        _cons |   .1506343   .0086975    17.32   0.000     .1335864    .1676821
-------------------------------------------------------------------------------

. 
. ** Mean (SD) by gender if EVER submit
. table author_gender_man if osfpub_ever == 1, stat(mean osfpub_num) stat(sd osf
> pub_num) stat (n osfpub_num)

----------------------------------------------------------------------------------------
                          |      Mean   Standard deviation   Number of nonmissing values
--------------------------+-------------------------------------------------------------
Author gender man=1 not=0 |                                                             
  Not man                 |  2.144444             2.400377                           360
  Man                     |  3.069892             4.020208                           558
  Total                   |  2.706972             3.503881                           918
----------------------------------------------------------------------------------------

. table author_gender_woman if osfpub_ever == 1, stat(mean osfpub_num) stat(sd o
> sfpub_num) stat (n osfpub_num)

---------------------------------------------------------------------------
             |      Mean   Standard deviation   Number of nonmissing values
-------------+-------------------------------------------------------------
Author woman |                                                             
  Not woman  |  2.998328             3.928805                           598
  Woman      |    2.1625             2.438941                           320
  Total      |  2.706972             3.503881                           918
---------------------------------------------------------------------------

. table author_gender_tnb if osfpub_ever == 1, stat(mean osfpub_num) stat(sd osf
> pub_num) stat (n osfpub_num)

-------------------------------------------------------------------------------------
                       |      Mean   Standard deviation   Number of nonmissing values
-----------------------+-------------------------------------------------------------
Author trans/nonbinary |                                                             
  0                    |     2.744             3.557417                           875
  1                    |     1.375             1.024695                            16
  Total                |  2.719416              3.53249                           891
-------------------------------------------------------------------------------------

. 
. reg osfpub_num author_gender_woman if osfpub_ever == 1

      Source |       SS           df       MS      Number of obs   =       918
-------------+----------------------------------   F(1, 916)       =     12.00
       Model |  145.627054         1  145.627054   Prob > F        =    0.0006
    Residual |  11112.5483       916   12.131603   R-squared       =    0.0129
-------------+----------------------------------   Adj R-squared   =    0.0119
       Total |  11258.1754       917  12.2771814   Root MSE        =     3.483

-------------------------------------------------------------------------------
   osfpub_num | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |  -.8358278   .2412431    -3.46   0.001    -1.309281   -.3623744
        _cons |   2.998328   .1424323    21.05   0.000     2.718796    3.277859
-------------------------------------------------------------------------------

. 
. ** Mean (SD) number WoS papers by (row name)
. table author_gender_man, stat(mean wospub_num) stat(sd wospub_num) stat (n wos
> pub_num)

----------------------------------------------------------------------------------------
                          |      Mean   Standard deviation   Number of nonmissing values
--------------------------+-------------------------------------------------------------
Author gender man=1 not=0 |                                                             
  Not man                 |  20.05458             23.95568                         8,612
  Man                     |  26.86476             35.81869                        10,995
  Total                   |  23.87351             31.35119                        19,607
----------------------------------------------------------------------------------------

. table author_gender_woman, stat(mean wospub_num) stat(sd wospub_num) stat(n wo
> spub_num)

---------------------------------------------------------------------------
             |      Mean   Standard deviation   Number of nonmissing values
-------------+-------------------------------------------------------------
Author woman |                                                             
  Not woman  |  26.59766             35.38989                        11,903
  Woman      |  19.66459               23.181                         7,704
  Total      |  23.87351             31.35119                        19,607
---------------------------------------------------------------------------

. table author_gender_tnb, stat(mean wospub_num) stat(sd wospub_num) stat(n wosp
> ub_num)

-------------------------------------------------------------------------------------
                       |      Mean   Standard deviation   Number of nonmissing values
-----------------------+-------------------------------------------------------------
Author trans/nonbinary |                                                             
  0                    |    23.894             31.35429                        18,651
  1                    |  17.26667             29.68471                           210
  Total                |  23.82021             31.34316                        18,861
-------------------------------------------------------------------------------------

. 
. ** Is gender significant predictor of WoS / SocArXiv publication totals?
. reg wospub_num author_gender_woman author_gender_tnb

      Source |       SS           df       MS      Number of obs   =    18,861
-------------+----------------------------------   F(2, 18858)     =    124.46
       Model |  241384.479         2  120692.239   Prob > F        =    0.0000
    Residual |  18286556.9    18,858  969.697574   R-squared       =    0.0130
-------------+----------------------------------   Adj R-squared   =    0.0129
       Total |  18527941.3    18,860  982.393496   Root MSE        =     31.14

-------------------------------------------------------------------------------
   wospub_num | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |  -7.155941   .4623749   -15.48   0.000    -8.062237   -6.249644
author_g~_tnb |  -8.928441   2.166035    -4.12   0.000    -13.17406   -4.682819
        _cons |   26.84255   .2971344    90.34   0.000     26.26014    27.42496
-------------------------------------------------------------------------------

. reg osfpub_num author_gender_woman author_gender_tnb

      Source |       SS           df       MS      Number of obs   =    18,861
-------------+----------------------------------   F(2, 18858)     =     10.79
       Model |  19.8697764         2  9.93488819   Prob > F        =    0.0000
    Residual |  17363.8567    18,858  .920768732   R-squared       =    0.0011
-------------+----------------------------------   Adj R-squared   =    0.0010
       Total |  17383.7265    18,860   .92172463   Root MSE        =    .95957

-------------------------------------------------------------------------------
   osfpub_num | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |  -.0659879   .0142479    -4.63   0.000    -.0939151   -.0380607
author_g~_tnb |  -.0451906   .0667456    -0.68   0.498     -.176018    .0856367
        _cons |   .1559229   .0091561    17.03   0.000     .1379761    .1738696
-------------------------------------------------------------------------------

. 
. 
. // WHAT % OF WORK AUTHORS PUT ON osfpub (author level)
. 
. ** % of total submissions to SocArXiv that come from (row name)
. table author_gender_man, stat(mean osfpub_percent) stat(n osfpub_percent)

-------------------------------------------------------------------
                          |      Mean   Number of nonmissing values
--------------------------+----------------------------------------
Author gender man=1 not=0 |                                        
  Not man                 |  .0031415                         8,611
  Man                     |  .0046124                        10,990
  Total                   |  .0039662                        19,601
-------------------------------------------------------------------

. table author_gender_woman, stat(mean osfpub_percent) stat(n osfpub_percent)

------------------------------------------------------
             |      Mean   Number of nonmissing values
-------------+----------------------------------------
Author woman |                                        
  Not woman  |  .0044708                        11,898
  Woman      |  .0031869                         7,703
  Total      |  .0039662                        19,601
------------------------------------------------------

. table author_gender_tnb, stat(mean osfpub_percent) stat(n osfpub_percent)

----------------------------------------------------------------
                       |      Mean   Number of nonmissing values
-----------------------+----------------------------------------
Author trans/nonbinary |                                        
  0                    |  .0040337                        18,645
  1                    |  .0045099                           210
  Total                |   .004039                        18,855
----------------------------------------------------------------

. 
. 
. ***--------------------------***
. *MODELS: for whether osfpub ever
. ***--------------------------***
. 
. *Base model
. logit osfpub_ever author_gender_woman author_gender_tnb, or

Iteration 0:  Log likelihood = -3589.3988  
Iteration 1:  Log likelihood = -3583.4758  
Iteration 2:  Log likelihood = -3583.3232  
Iteration 3:  Log likelihood = -3583.3228  
Iteration 4:  Log likelihood = -3583.3228  

Logistic regression                                     Number of obs = 18,861
                                                        LR chi2(2)    =  12.15
                                                        Prob > chi2   = 0.0023
Log likelihood = -3583.3228                             Pseudo R2     = 0.0017

-------------------------------------------------------------------------------
  osfpub_ever | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |   .8099625   .0580625    -2.94   0.003      .703795    .9321453
author_g~_tnb |   1.570931   .4135498     1.72   0.086     .9377283    2.631704
        _cons |   .0534314    .002323   -67.38   0.000     .0490669     .058184
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estimates store model1

. 
. * add author-level controls
. logit osfpub_ever author_gender_woman author_gender_tnb ///
>         $author_level_controls ///
>         , or

Iteration 0:  Log likelihood = -3561.2998  
Iteration 1:  Log likelihood =  -3521.376  
Iteration 2:  Log likelihood =  -3519.544  
Iteration 3:  Log likelihood = -3519.5371  
Iteration 4:  Log likelihood = -3519.5371  

Logistic regression                                     Number of obs = 18,653
                                                        LR chi2(9)    =  83.53
                                                        Prob > chi2   = 0.0000
Log likelihood = -3519.5371                             Pseudo R2     = 0.0117

-------------------------------------------------------------------------------
  osfpub_ever | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |   .7981908    .057527    -3.13   0.002     .6930413    .9192937
author_g~_tnb |   1.564773   .4132982     1.70   0.090      .932452    2.625889
   race_black |    .401229   .1182083    -3.10   0.002     .2252242    .7147753
race_other_~n |   .5336198   .0952552    -3.52   0.000      .376085     .757143
 race_chinese |   .4248178   .0859812    -4.23   0.000     .2857086    .6316581
  race_indian |   .3642126    .111914    -3.29   0.001     .1994348     .665134
    race_mena |   .3593427   .1156751    -3.18   0.001     .1912056    .6753314
  race_latine |    .769664   .1019943    -1.98   0.048     .5936106    .9979315
race_other_~w |   .7430976   .1141806    -1.93   0.053     .5498631    1.004239
        _cons |   .0635253   .0030419   -57.56   0.000     .0578345     .069776
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estimates store model2

. 
. * add author ever published in feminist journal 
. logit osfpub_ever author_gender_woman author_gender_tnb ///
>         $author_level_controls ///
>         journal_feminist_ever ///
>         , or

Iteration 0:  Log likelihood = -3542.9913  
Iteration 1:  Log likelihood = -3488.6114  
Iteration 2:  Log likelihood = -3483.3048  
Iteration 3:  Log likelihood = -3483.2988  
Iteration 4:  Log likelihood = -3483.2988  

Logistic regression                                     Number of obs = 18,647
                                                        LR chi2(10)   = 119.38
                                                        Prob > chi2   = 0.0000
Log likelihood = -3483.2988                             Pseudo R2     = 0.0168

-------------------------------------------------------------------------------
  osfpub_ever | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |   .7411995   .0549254    -4.04   0.000     .6410002    .8570617
author_g~_tnb |   1.255097   .3377807     0.84   0.399      .740621    2.126958
   race_black |   .3976091   .1172312    -3.13   0.002     .2230939    .7086387
race_other_~n |   .5509166   .0984404    -3.34   0.001     .3881406    .7819566
 race_chinese |   .4454987   .0902698    -3.99   0.000     .2994819    .6627082
  race_indian |   .3647486   .1121512    -3.28   0.001     .1996504    .6663725
    race_mena |   .3220507   .1091503    -3.34   0.001      .165742    .6257717
  race_latine |   .7867232   .1043917    -1.81   0.071      .606561    1.020398
race_other_~w |   .7456096   .1147048    -1.91   0.056     .5515215       1.008
journal_fem~r |   2.109771    .243835     6.46   0.000     1.682125    2.646136
        _cons |   .0609528   .0029621   -57.57   0.000     .0554151    .0670439
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estimates store model3

. 
. etable, estimates(model1 model2 model3) ///
>         mstat(N) mstat(r2_a) column(index) ///
>         showstars showstarsnote stars(.05 "*" .01 "**" .001 "***", attach(_r_b
> )) ///
>         title("Logistic Regression Models predicting whether author ever publi
> shes on SocArXiv (ORs)") ///
>         export($results/osf20_osfpub_ever.docx, as(docx) replace)

Logistic Regression Models predicting whether author ever publishes on SocArXiv (ORs)
--------------------------------------------------------------------------------------------------------------------
                                                                                      1           2           3     
--------------------------------------------------------------------------------------------------------------------
Author woman                                                                       0.810 **    0.798 **    0.741 ***
                                                                                 (0.058)     (0.058)     (0.055)    
Author trans/nonbinary                                                             1.571       1.565       1.255    
                                                                                 (0.414)     (0.413)     (0.338)    
Black or African American                                                                      0.401 **    0.398 ** 
                                                                                             (0.118)     (0.117)    
Other Asian                                                                                    0.534 ***   0.551 ***
                                                                                             (0.095)     (0.098)    
Chinese                                                                                        0.425 ***   0.445 ***
                                                                                             (0.086)     (0.090)    
Indian                                                                                         0.364 **    0.365 ** 
                                                                                             (0.112)     (0.112)    
Middle Eastern or North African                                                                0.359 **    0.322 ***
                                                                                             (0.116)     (0.109)    
Hispanic, Spanish, or Latina/o/x                                                               0.770 *     0.787    
                                                                                             (0.102)     (0.104)    
Other Race / American Indian / Alaska Native or Native Hawiian / Pacific Islande               0.743       0.746    
                                                                                             (0.114)     (0.115)    
Author ever published article in feminist journal                                                          2.110 ***
                                                                                                         (0.244)    
Intercept                                                                          0.053 ***   0.064 ***   0.061 ***
                                                                                 (0.002)     (0.003)     (0.003)    
Number of observations                                                             18861       18653       18647    
--------------------------------------------------------------------------------------------------------------------
*** p<.001, ** p<.01, * p<.05
(collection ETable exported to file
 ~/Documents/SocResearch/SocArXiv_gender/results/osf20_osfpub_ever.docx)

. 
. 
. ***--------------------------***
. * MODEL: PROPORTION OF WORK PUT on SocArXiv
. ***--------------------------***
. * fracreg logit osfpub_percent independent_variables, or
. * fractional logit appropriate for DVs that can also = 0 or 1
. 
. use $clean/survey_authors.dta, clear

. 
. sum osfpub_percent, det

          % WoS pubs posted on SocArXiv (by author)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              19,601
25%            0              0       Sum of wgt.      19,601

50%            0                      Mean           .0039662
                        Largest       Std. dev.      .0369593
75%            0              1
90%            0              1       Variance        .001366
95%            0              1       Skewness       16.03351
99%         .125              1       Kurtosis         332.02

. 
. * Base model
. fracreg logit osfpub_percent author_gender_woman author_gender_tnb ///
>         , or

Iteration 0:  Log pseudolikelihood =  -13107.09  
Iteration 1:  Log pseudolikelihood = -497.13228  
Iteration 2:  Log pseudolikelihood =  -494.6457  
Iteration 3:  Log pseudolikelihood =  -494.5444  
Iteration 4:  Log pseudolikelihood = -494.54431  
Iteration 5:  Log pseudolikelihood = -494.54431  

Fractional logistic regression                          Number of obs = 18,855
                                                        Wald chi2(2)  =   6.73
                                                        Prob > chi2   = 0.0346
Log pseudolikelihood = -494.54431                       Pseudo R2     = 0.0024

-------------------------------------------------------------------------------
              |               Robust
osfpub_perc~t | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |   .6877018   .0995478    -2.59   0.010     .5178274    .9133038
author_g~_tnb |   1.002869   .4688749     0.01   0.995     .4011246    2.507318
        _cons |   .0046489    .000388   -64.35   0.000     .0039473    .0054751
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estimates store model1

. 
. * add author-level controls
. fracreg logit osfpub_percent author_gender_woman author_gender_tnb ///
>         $author_level_controls ///
>         , or

Iteration 0:  Log pseudolikelihood = -12962.552  
Iteration 1:  Log pseudolikelihood = -492.27776  
Iteration 2:  Log pseudolikelihood = -486.38839  
Iteration 3:  Log pseudolikelihood = -485.89226  
Iteration 4:  Log pseudolikelihood = -485.88945  
Iteration 5:  Log pseudolikelihood = -485.88945  

Fractional logistic regression                          Number of obs = 18,647
                                                        Wald chi2(9)  =  40.88
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -485.88945                       Pseudo R2     = 0.0107

-------------------------------------------------------------------------------
              |               Robust
osfpub_perc~t | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |   .6795719   .0991955    -2.65   0.008     .5104904    .9046556
author_g~_tnb |   1.004188   .4715333     0.01   0.993     .4000545    2.520641
   race_black |   .1926082   .0930669    -3.41   0.001     .0747103    .4965573
race_other_~n |    .653516   .2184495    -1.27   0.203     .3394117    1.258304
 race_chinese |   .3282964   .1288243    -2.84   0.005     .1521432    .7084017
  race_indian |   .3682719   .1473442    -2.50   0.013     .1681148    .8067354
    race_mena |   .3803087   .1792689    -2.05   0.040     .1509729    .9580174
  race_latine |    .639749   .1364705    -2.09   0.036     .4211456    .9718226
race_other_~w |   .7268051   .2394212    -0.97   0.333     .3810821    1.386173
        _cons |     .00559   .0005164   -56.14   0.000     .0046642    .0066996
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estimates store model2

. 
. * add author ever published in feminist journal 
. fracreg logit osfpub_percent author_gender_woman author_gender_tnb ///
>         $author_level_controls ///
>         journal_feminist_ever ///
>         , or

Iteration 0:  Log pseudolikelihood = -12962.528  
Iteration 1:  Log pseudolikelihood = -492.01841  
Iteration 2:  Log pseudolikelihood = -485.77121  
Iteration 3:  Log pseudolikelihood = -483.09243  
Iteration 4:  Log pseudolikelihood = -483.06416  
Iteration 5:  Log pseudolikelihood = -483.06415  

Fractional logistic regression                          Number of obs = 18,647
                                                        Wald chi2(10) =  50.98
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -483.06415                       Pseudo R2     = 0.0164

-------------------------------------------------------------------------------
              |               Robust
osfpub_perc~t | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |   .6063159   .0940437    -3.23   0.001     .4473751    .8217243
author_g~_tnb |   .7231438   .3595777    -0.65   0.514     .2728798    1.916364
   race_black |   .1886341   .0911058    -3.45   0.001     .0731999    .4861052
race_other_~n |   .6756611   .2254992    -1.17   0.240     .3512722    1.299613
 race_chinese |   .3460686   .1357634    -2.70   0.007      .160411    .7466038
  race_indian |   .3673084   .1469757    -2.50   0.012     .1676598    .8046975
    race_mena |   .3749875   .1769303    -2.08   0.038     .1487286    .9454512
  race_latine |    .651694   .1388614    -2.01   0.044     .4292119    .9894998
race_other_~w |   .7229653   .2385735    -0.98   0.326     .3786403     1.38041
journal_fem~r |   2.572599    .617992     3.93   0.000     1.606556    4.119538
        _cons |   .0053386   .0004866   -57.41   0.000     .0044652    .0063828
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estimates store model3

. 
. 
. etable, estimates(model1 model2 model3) ///
>         mstat(N) mstat(r2) column(index) ///
>         showstars showstarsnote stars(.05 "*" .01 "**" .001 "***", attach(_r_b
> )) ///
>         title("Fractional Response Logistic Regression Models predicting" ///
>                   "% of published work author posts in SocArXiv") ///
>         export($results/osf20_osfpub_percent_allauthors_appendix.docx, as(docx
> ) replace)

Fractional Response Logistic Regression Models predicting % of published work author posts in SocArXiv
--------------------------------------------------------------------------------------------------------------------
                                                                                      1           2           3     
--------------------------------------------------------------------------------------------------------------------
Author woman                                                                       0.688 **    0.680 **    0.606 ** 
                                                                                 (0.100)     (0.099)     (0.094)    
Author trans/nonbinary                                                             1.003       1.004       0.723    
                                                                                 (0.469)     (0.472)     (0.360)    
Black or African American                                                                      0.193 ***   0.189 ***
                                                                                             (0.093)     (0.091)    
Other Asian                                                                                    0.654       0.676    
                                                                                             (0.218)     (0.225)    
Chinese                                                                                        0.328 **    0.346 ** 
                                                                                             (0.129)     (0.136)    
Indian                                                                                         0.368 *     0.367 *  
                                                                                             (0.147)     (0.147)    
Middle Eastern or North African                                                                0.380 *     0.375 *  
                                                                                             (0.179)     (0.177)    
Hispanic, Spanish, or Latina/o/x                                                               0.640 *     0.652 *  
                                                                                             (0.136)     (0.139)    
Other Race / American Indian / Alaska Native or Native Hawiian / Pacific Islande               0.727       0.723    
                                                                                             (0.239)     (0.239)    
Author ever published article in feminist journal                                                          2.573 ***
                                                                                                         (0.618)    
Intercept                                                                          0.005 ***   0.006 ***   0.005 ***
                                                                                 (0.000)     (0.001)     (0.000)    
Number of observations                                                             18855       18647       18647    
--------------------------------------------------------------------------------------------------------------------
*** p<.001, ** p<.01, * p<.05
(collection ETable exported to file
 ~/Documents/SocResearch/SocArXiv_gender/results/osf20_osfpub_percent_allautho
 > rs_appendix.docx)

. 
. 
. ** SAME SET of MODELS but only for those who EVER SUBMIT TO OSF
. keep if osfpub_ever == 1
(18,689 observations deleted)

. sum osfpub_percent, det

          % WoS pubs posted on SocArXiv (by author)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 912
25%            0              0       Sum of wgt.         912

50%     .0307765                      Mean           .0852434
                        Largest       Std. dev.      .1498437
75%           .1              1
90%     .2272727              1       Variance       .0224531
95%     .3333333              1       Skewness       3.391458
99%     .7857143              1       Kurtosis       17.25036

. 
. * Base model
. fracreg logit osfpub_percent author_gender_woman author_gender_tnb ///
>         , or

Iteration 0:  Log pseudolikelihood = -645.72779  
Iteration 1:  Log pseudolikelihood = -259.42925  
Iteration 2:  Log pseudolikelihood = -259.19591  
Iteration 3:  Log pseudolikelihood = -259.19506  
Iteration 4:  Log pseudolikelihood = -259.19506  

Fractional logistic regression                          Number of obs =    885
                                                        Wald chi2(2)  =   2.97
                                                        Prob > chi2   = 0.2267
Log pseudolikelihood = -259.19506                       Pseudo R2     = 0.0015

-------------------------------------------------------------------------------
              |               Robust
osfpub_perc~t | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |   .8217581   .1138321    -1.42   0.156     .6263733    1.078089
author_g~_tnb |   .6201489   .2629676    -1.13   0.260     .2701177    1.423767
        _cons |   .1014538   .0080677   -28.77   0.000     .0868121    .1185651
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estimates store model1

. 
. * add author-level controls
. fracreg logit osfpub_percent author_gender_woman author_gender_tnb ///
>         $author_level_controls ///
>         , or

Iteration 0:  Log pseudolikelihood = -641.23451  
Iteration 1:  Log pseudolikelihood = -257.01664  
Iteration 2:  Log pseudolikelihood = -256.59029  
Iteration 3:  Log pseudolikelihood = -256.58756  
Iteration 4:  Log pseudolikelihood = -256.58756  

Fractional logistic regression                          Number of obs =    879
                                                        Wald chi2(9)  =   9.51
                                                        Prob > chi2   = 0.3913
Log pseudolikelihood = -256.58756                       Pseudo R2     = 0.0032

-------------------------------------------------------------------------------
              |               Robust
osfpub_perc~t | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |   .8226365   .1149656    -1.40   0.162     .6255331    1.081846
author_g~_tnb |   .6405083    .281167    -1.01   0.310     .2709373    1.514192
   race_black |   .4422113   .1775727    -2.03   0.042     .2012911    .9714828
race_other_~n |   1.245576   .3971029     0.69   0.491     .6668038     2.32671
 race_chinese |   .7471445   .2715328    -0.80   0.423     .3664837    1.523192
  race_indian |   .9840294   .2893028    -0.05   0.956     .5530398    1.750894
    race_mena |   1.142911   .4090513     0.37   0.709     .5667151    2.304942
  race_latine |   .7898309    .146179    -1.27   0.202      .549537    1.135197
race_other_~w |   .9638741   .3103449    -0.11   0.909     .5128063    1.811704
        _cons |   .1035226   .0091032   -25.79   0.000     .0871336    .1229942
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estimates store model2

. 
. * add author ever published in feminist journal 
. fracreg logit osfpub_percent author_gender_woman author_gender_tnb ///
>         $author_level_controls ///
>         journal_feminist_ever ///
>         , or

Iteration 0:  Log pseudolikelihood = -641.19785  
Iteration 1:  Log pseudolikelihood = -256.84921  
Iteration 2:  Log pseudolikelihood = -256.32249  
Iteration 3:  Log pseudolikelihood = -256.31921  
Iteration 4:  Log pseudolikelihood = -256.31921  

Fractional logistic regression                          Number of obs =    879
                                                        Wald chi2(10) =   9.96
                                                        Prob > chi2   = 0.4439
Log pseudolikelihood = -256.31921                       Pseudo R2     = 0.0043

-------------------------------------------------------------------------------
              |               Robust
osfpub_perc~t | Odds ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
author_g~oman |   .7856475    .117451    -1.61   0.107     .5861068    1.053122
author_g~_tnb |   .5856775   .2706218    -1.16   0.247     .2367811    1.448672
   race_black |   .4080003   .1712181    -2.14   0.033     .1792471    .9286859
race_other_~n |   1.280578   .4101288     0.77   0.440     .6835854    2.398938
 race_chinese |   .7609562   .2755904    -0.75   0.451     .3741844     1.54751
  race_indian |   .9966186    .291936    -0.01   0.991     .5612928    1.769573
    race_mena |   1.079726   .4111059     0.20   0.840     .5119391     2.27724
  race_latine |   .8021512   .1487976    -1.19   0.235     .5576476    1.153859
race_other_~w |   .9884482   .3193739    -0.04   0.971     .5247172    1.862012
journal_fem~r |   1.329974   .3111253     1.22   0.223     .8408506    2.103622
        _cons |   .1015057   .0088086   -26.36   0.000     .0856295    .1203253
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. estimates store model3

. 
. etable, estimates(model1 model2 model3) ///
>         mstat(N) mstat(r2) column(index) ///
>         showstars showstarsnote stars(.05 "*" .01 "**" .001 "***", attach(_r_b
> )) ///
>         title("Fractional Response Logistic Regression Models predicting" ///
>                   "% of published work author posts in SocArXiv," ///
>                   "for those who ever submit") ///
>         export($results/osf20_osfpub_percent_everosf_appendix.docx, as(docx) r
> eplace)

Fractional Response Logistic Regression Models predicting % of published work author posts in SocArXiv, for those who ever submit
--------------------------------------------------------------------------------------------------------------------
                                                                                      1           2           3     
--------------------------------------------------------------------------------------------------------------------
Author woman                                                                       0.822       0.823       0.786    
                                                                                 (0.114)     (0.115)     (0.117)    
Author trans/nonbinary                                                             0.620       0.641       0.586    
                                                                                 (0.263)     (0.281)     (0.271)    
Black or African American                                                                      0.442 *     0.408 *  
                                                                                             (0.178)     (0.171)    
Other Asian                                                                                    1.246       1.281    
                                                                                             (0.397)     (0.410)    
Chinese                                                                                        0.747       0.761    
                                                                                             (0.272)     (0.276)    
Indian                                                                                         0.984       0.997    
                                                                                             (0.289)     (0.292)    
Middle Eastern or North African                                                                1.143       1.080    
                                                                                             (0.409)     (0.411)    
Hispanic, Spanish, or Latina/o/x                                                               0.790       0.802    
                                                                                             (0.146)     (0.149)    
Other Race / American Indian / Alaska Native or Native Hawiian / Pacific Islande               0.964       0.988    
                                                                                             (0.310)     (0.319)    
Author ever published article in feminist journal                                                          1.330    
                                                                                                         (0.311)    
Intercept                                                                          0.101 ***   0.104 ***   0.102 ***
                                                                                 (0.008)     (0.009)     (0.009)    
Number of observations                                                               885         879         879    
--------------------------------------------------------------------------------------------------------------------
*** p<.001, ** p<.01, * p<.05
(collection ETable exported to file
 ~/Documents/SocResearch/SocArXiv_gender/results/osf20_osfpub_percent_everosf_
 > appendix.docx)

.         
. 
. ***--------------------------***
. log close osf20
      name:  osf20
       log:  /Users/mmking/Documents/SocResearch/SocArXiv_gender/stata/osf20_aut
> hor_outcomes.smcl
  log type:  text
 closed on:   3 Mar 2025, 13:51:47
--------------------------------------------------------------------------------
